In [1]:
#Import package pandas for data analysis
import pandas as pd

# Import package numpy for numeric computing
import numpy as np

# Import package matplotlib for visualisation/plotting
import matplotlib.pyplot as plt

In [2]:
dynamic = pd.read_csv('db_backup/05.04/BikeData_DynamicData.csv', names=['StationNumber' , 'StationName', 'AvailableBikes' , 'AvailableBikeStands', 'Date', 'Time'])
static = pd.read_csv('db_backup/05.04/BikeData_StaticData.csv', names=['StationNumber', 'StationName', 'Address', 'Latitude', 'Longitude', 'Banking'])
weather = pd.read_csv('db_backup/05.04/BikeData_WeatherData.csv', names=['Date', 'Time', 'Rainfall', 'Temperature', 'Icon', 'WindSpeed'])

## Static Data

In [3]:
#Displaying the first few and last rows of the static table
static

,StationNumber,StationName,Address,Latitude,Longitude,Banking
0,42,SMITHFIELD NORTH,Smithfield North,53.349562,-6.278198,1
1,30,PARNELL SQUARE NORTH,Parnell Square North,53.353462,-6.265305,1
2,54,CLONMEL STREET,Clonmel Street,53.336021,-6.262980,0
3,108,AVONDALE ROAD,Avondale Road,53.359405,-6.276142,0
4,56,MOUNT STREET LOWER,Mount Street Lower,53.337960,-6.241530,0
...,...,...,...,...,...,...
105,39,WILTON TERRACE,Wilton Terrace,53.332383,-6.252717,1
106,83,EMMET ROAD,Emmet Road,53.340714,-6.308191,0
107,92,HEUSTON BRIDGE (NORTH),Heuston Bridge (North),53.347802,-6.292432,0
108,21,LEINSTER STREET SOUTH,Leinster Street South,53.342180,-6.254485,0
109,88,BLACKHALL PLACE,Blackhall Place,53.348800,-6.281637,0

- There are 110 stations.

In [4]:
# Number of empty cells for each column
static.isnull().sum()

StationNumber    0
StationName      0
Address          0
Latitude         0
Longitude        0
Banking          0
dtype: int64

In [15]:
station_number=static['StationNumber']
station_number

0       42
1       30
2       54
3      108
4       56
      ...
105     39
106     83
107     92
108     21
109     88
Name: StationNumber, Length: 110, dtype: int64

## Dynamic Data

In [6]:
#Displaying the first few and last rows of the dynamic table
dynamic

,StationNumber,StationName,AvailableBikes,AvailableBikeStands,Date,Time
0,42,SMITHFIELD NORTH,2,28,2020-02-21,12:52:58
1,30,PARNELL SQUARE NORTH,1,19,2020-02-21,12:54:29
2,54,CLONMEL STREET,25,8,2020-02-21,12:54:39
3,108,AVONDALE ROAD,4,36,2020-02-21,12:50:23
4,56,MOUNT STREET LOWER,27,13,2020-02-21,12:47:41
...,...,...,...,...,...,...
1267408,39,WILTON TERRACE,9,11,2020-04-05,00:02:59
1267409,83,EMMET ROAD,25,15,2020-04-05,00:02:36
1267410,92,HEUSTON BRIDGE (NORTH),28,12,2020-04-05,00:03:23
1267411,21,LEINSTER STREET SOUTH,11,19,2020-04-05,00:02:35
1267412,88,BLACKHALL PLACE,13,17,2020-04-05,00:02:47

In [7]:
print('Number of duplicate (excluding first) rows in the table is: ', dynamic.duplicated().sum())

Number of duplicate (excluding first) rows in the table is:  539671

In [8]:
# Number of empty cells for each column
dynamic.isnull().sum()

StationNumber          0
StationName            0
AvailableBikes         0
AvailableBikeStands    0
Date                   0
Time                   0
dtype: int64

In [9]:
dynamic.dtypes

StationNumber           int64
StationName            object
AvailableBikes          int64
AvailableBikeStands     int64
Date                   object
Time                   object
dtype: object

In [10]:
# Converting StationNumber to object so it does not appear during descriptive stats
dynamic['StationNumber'] = dynamic['StationNumber'].astype('object')

In [11]:
# Displaying descriptive stats for numeric columns
numeric_cols = dynamic.select_dtypes(['int64']).columns
dynamic[numeric_cols].describe().T

,count,mean,std,min,25%,50%,75%,max
AvailableBikes,1267413.0,11.709242,8.859460,0.0,5.0,10.0,17.0,40.0
AvailableBikeStands,1267413.0,20.368143,10.453886,0.0,13.0,20.0,28.0,41.0

In [16]:
new = dynamic.loc[(dynamic['StationNumber'] == 42)]
new

,StationNumber,StationName,AvailableBikes,AvailableBikeStands,Date,Time
0,42,SMITHFIELD NORTH,2,28,2020-02-21,12:52:58
109,42,SMITHFIELD NORTH,0,30,2020-02-21,12:59:42
218,42,SMITHFIELD NORTH,0,30,2020-02-21,12:59:42
327,42,SMITHFIELD NORTH,0,30,2020-02-21,13:09:50
436,42,SMITHFIELD NORTH,0,30,2020-02-21,13:09:50
...,...,...,...,...,...,...
1266863,42,SMITHFIELD NORTH,20,10,2020-04-04,23:42:47
1266973,42,SMITHFIELD NORTH,20,10,2020-04-04,23:42:47
1267083,42,SMITHFIELD NORTH,20,10,2020-04-04,23:52:54
1267193,42,SMITHFIELD NORTH,20,10,2020-04-04,23:52:54
1267303,42,SMITHFIELD NORTH,20,10,2020-04-05,00:03:02

## Weather Data

In [13]:
#Displaying the first few and last rows of the dynamic table
weather

            Date      Time  Rainfall  Temperature         Icon  WindSpeed
0     2020-02-21  13:00:05       0.0         10.1          NaN        NaN
1     2020-02-21  13:30:02       0.0         10.2          NaN        NaN
2     2020-02-21  14:00:02       0.0         10.2          NaN        NaN
3     2020-02-22  14:30:01       0.0          7.4          NaN        NaN
4     2020-02-22  15:00:02       0.0          7.4          NaN        NaN
...          ...       ...       ...          ...          ...        ...
1948  2020-04-04  22:00:03       0.0          9.7  clear-night      21.36
1949  2020-04-04  22:30:02       0.0          9.6  clear-night      21.50
1950  2020-04-04  23:00:04       0.0          9.6  clear-night      21.68
1951  2020-04-04  23:30:02       0.0          9.5  clear-night      21.77
1952  2020-04-05  00:00:03       0.0          9.5  clear-night      21.55

[1953 rows x 6 columns]

In [14]:
# Number of empty cells for each column
weather.isnull().sum()

Date             0
Time             0
Rainfall         0
Temperature      0
Icon           387
WindSpeed      388
dtype: int64